'use strict'

// Задание 1
let a = 1, b = 1;

let c = ++a; // c = 2
let d = b++; // d = 1

// Задание 2
a = 2;

let x = 1 + (a *= 2);  // a = 4; x = 5

// Задание 3
"" + 1 + 0  // "10" - cтрока
"" - 1 + 0  // -1 - число
true + false  // 1 - чисмло 
6 / "3"  // 2 - число 
"2" * "3"  // 6 - число
4 + 5 + "px"  // "9px" - строка
"$" + 4 + 5  // "$45" - строка
"4" - 2  // 2 - число
"4px" - 2  // NaN
"  -9  " + 5  // "  -9  5" - строка
"  -9  " - 5  // -14 - число
null + 1  // 1 - число
undefined + 1  // NaN
" \t \n" - 2  // -2 - число 

// Задание 4
a = prompt("Первое число?", 1);
b = prompt("Второе число?", 2);

alert(+a + +b); // 3

// Или можно так: 
a = +prompt("Первое число?", 1);
b = +prompt("Второе число?", 2);

alert(a + b); // 3